---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.SegmentId
source: html/e48690ea-53e4-84d4-2602-9ec67d68dc9d.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentId.SegmentId Property

The segment identifier.

## Syntax (C#)
```csharp
public int SegmentId { get; set; }
```